app/controllers/users_controller.rb

  def home
    puts "/n******* home *******"
    @users = User.all
---
SELECT "users".* FROM "users"